---
type: IModelExportContext
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# IModelExportContext

`Autodesk.Revit.DB.IModelExportContext` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OnPoint | 2016 | `RenderNodeAction OnPoint ( PointNode node )` |